{"backend": "theano", "config": [{"class_name": "Conv2D", "config": {"bias_regularizer": null, "batch_input_shape": [null, 1, 64, 64], "activation": "linear", "trainable": true, "dtype": "float32", "padding": "same", "bias_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_26", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "data_format": "channels_first", "use_bias": true, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}}, "kernel_size": [3, 3], "activity_regularizer": null, "kernel_regularizer": null, "strides": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "padding": "valid", "name": "max_pooling2d_25", "pool_size": [2, 2], "trainable": true, "data_format": "channels_first"}}, {"class_name": "Dropout", "config": {"name": "dropout_25", "rate": 0.5, "trainable": true}}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "activation": "linear", "trainable": true, "padding": "same", "bias_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_27", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "strides": [1, 1], "use_bias": true, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}}, "kernel_size": [3, 3], "activity_regularizer": null, "kernel_regularizer": null, "data_format": "channels_first"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "padding": "valid", "name": "max_pooling2d_26", "pool_size": [2, 2], "trainable": true, "data_format": "channels_first"}}, {"class_name": "Dropout", "config": {"name": "dropout_26", "rate": 0.5, "trainable": true}}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "activation": "linear", "trainable": true, "padding": "same", "bias_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_28", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 128, "strides": [1, 1], "use_bias": true, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}}, "kernel_size": [3, 3], "activity_regularizer": null, "kernel_regularizer": null, "data_format": "channels_first"}}, {"class_name": "MaxPooling2D", "config": {"strides": [8, 8], "padding": "valid", "name": "max_pooling2d_27", "pool_size": [8, 8], "trainable": true, "data_format": "channels_first"}}, {"class_name": "Dropout", "config": {"name": "dropout_27", "rate": 0.5, "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_9", "trainable": true}}, {"class_name": "Dense", "config": {"bias_constraint": null, "activation": "linear", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_9", "units": 10, "use_bias": true, "kernel_constraint": null, "trainable": true, "activity_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}}}, {"class_name": "Activation", "config": {"name": "activation_9", "activation": "softmax", "trainable": true}}], "keras_version": "2.0.5", "class_name": "Sequential"}
